Revit 2027 API
BuiltInFailures.OverlapFailures.CurvesOverlap Property
 Highlighted lines overlap. Lines may not form closed loops.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CurvesOverlap { get; }
Public Shared ReadOnly Property CurvesOverlap As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CurvesOverlap {
	FailureDefinitionId^ get ();
}
static member CurvesOverlap : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.OverlapFailures Class
Autodesk.Revit.DB Namespace